# -*- time-stamp-pattern: "6/#\\+DATE: +[\"<]%:y-%02m-%02d %02H:%02M:%02S %u[\">]" -*-
#+TITLE: Emacs Configuration
#+AUTHOR: Renald Buter
#+EMAIL: renald.buter@xs4all.nl
#+DATE: <2019-01-17 22:25:31 buter>
#+OPTIONS: toc:nil num:nil
#+PROPERTY: header-args :tangle yes

This is my emacs configuration, the result of many years of copying and pasting from all over the internet. Thanks to
the literate programming capabilites of org-mode and some peeking at examples such as [[https://raw.githubusercontent.com/sachac/.emacs.d/gh-pages/Sacha.org][Sacha Chua's emacs config]], or [[https://raw.githubusercontent.com/larstvei/dot-emacs/master/init.org][this
configuration]] and [[https://raw.githubusercontent.com/jamiecollinson/dotfiles/master/config.org][this configuration]].

** Abbrev

#+begin_src emacs-lisp
;; Abbrev
;(setq abbrev-file-name             ;; tell emacs where to read abbrev
;      (expand-file-name (concat emacs-root "/abbrev_defs")))
;(setq save-abbrevs 'silent)        ;; save abbrevs when files are saved
#+end_src

#+NAME: abbrev
| Base    | Expansion                   |
|---------+-----------------------------|
| bc      | because                     |
| wo      | without                     |
| gddr    | GoDataDriven                |
| gddhttp | http://www.godatadriven.com |
| gsprm   | gesproken met               |
|         |                             |

#+BEGIN_SRC emacs-lisp :var data=abbrev 
(mapc (lambda (x) (define-global-abbrev (car x) (cadr x))) (cddr data))
#+END_SRC

#+RESULTS:
| gddr    | GoDataDriven                |
| gddhttp | http://www.godatadriven.com |
| gsprm   | gesproken met               |
|         |                             |

#+BEGIN_SRC emacs-lisp 
(add-hook 'text-mode-hook 'abbrev-mode)
#+END_SRC

